local Games = {
    [7265785337] = "穷小子打工记",
    [1512676568] = "河北唐县",
    [873703865] = "一路向西",
    [7018190066] = "死铁轨",
    [1275875292] = "提升模拟器",
    [1526814825] = "战争大亨",
    [1268927906] = "力量传奇",
    [1119466531] = "极速传奇",
    [3358419523] = "动物进化模拟器",
    [2564505263] = "超级大力士模拟器",
    [3085257211] = "彩虹朋友",
    [73885730] = "监狱人生",
    [1489026993] = "生存杀手",
    [1840897362] = "火箭发射模拟器",
    [93740418] = "极限捉迷藏",
    [279565647] = "幸运方块",
    [2157872230] = "感染的微笑",
    [274816972] = "CarCrushers2",
    [5677613211] = "吃掉世界",
    [210851291] = "造船寻宝",
    [2471084] = "伐木大亨",
    [4367208330] = "压力",
    [3717264063] = "Nico的下一个机器人",
    [65241] = "自然灾害",
    [2640407187] = "驾驶汽车印尼",
    [7326934954] = "森林中的99夜",
    [2820580801] = "俄亥俄州",
    [1782832995] = "通用时间",
    [6331902150] = "被遗弃",
    [2440500124] = "Doors",
    [66654135] = "破坏者谜团2",
    [4777817887] = "刀刃球",
    [7008097940] = "墨水游戏",
    [1494262959] = "犯罪",
    [994732206] = "BloxFruits",
    [371263894] = "格林维尔",
    [3808081382] = "最强战场",
    [605887098] = "汽车经销大亨",
    [1202096104] = "驾驶帝国",
    [7436755782] = "种植花园",
    [770538576] = "海战",
    [4348829796] = "杀手vs警长",
    [5750914919] = "Fisch",
    [1335695570] = "忍者传奇",
    [245662005] = "越狱",
    [7709344486] = "偷走脑红",
    [5995470825] = "狙击步枪",
    [5012222382] = "枪战竞技场",
    [6325068386] = "蓝色锁",
    [601130232] = "蜂群模拟器",
    [7822444776] = "建造一架飞机",
    [2992873140] = "紧急汉堡"
}

local cloneref = cloneref or function(a) return a end
local CoreGui = cloneref(game:GetService("CoreGui"))

if not ({...})[1] then
    local name = Games[game.GameId]
    if name then
        loadstring(game:HttpGet("https://raw.githubusercontent.com/Arter12/tianscript/refs/heads/main/Games/"..(name)..".lua"))()
    else
        local message = Instance.new("Message", CoreGui)
        message.Text = "此游戏不受支持"
        task.wait(2)
        message:destroy()
    end
end

return Games
